public class Main {

    public static void main(String[] args) {
        Сотрудник[] сотрудникs = new Сотрудник[5];
        сотрудникs[0] = new Сотрудник(
                "Белова Марина",
                "помощник",
                "marina@mail.ru",
                "+79562214146",
                30000,
                20);
        сотрудникs[1] = new Сотрудник(
                "Иванов Петр",
                "младший специалист",
                "petr@mail.ru",
                "+798525545",
                35000,
                19);
        сотрудникs[2] = new Сотрудник(
                "Белкина Ольга",
                "младший специалист",
                "ol@mail.ru",
                "+796668945",
                35000,
                45);
        сотрудникs[3] = new Сотрудник(
                "Кошина Дарья",
                "помощник",
                "dar@mail.ru",
                "+794528945",
                30000,
                25);
        сотрудникs[4] = new Сотрудник(
                "Серина Анна",
                "младший специалист",
                "ann@mail.ru",
                "+798523945",
                35000,
                42);


        for (int i=0; i<5; i++) {
            if (сотрудникs[i].возраст>40) {
                сотрудникs[i].вывестиИнформацию();
            }
        }

    }
}
